# Wprowadzenie do Pandas

Ta część przeznaczona jest przetwarzaniu danych z użyciem biblioteki Pandas:

* Wprowadzenie do Pandas
* Serie danych (Serie)
* Ramki danych (DataFrame)
* Braki danych
* Grupowanie (GroupBy)
* Łączenie danych (Merging,Joining,Concatenating)
* Operacje na ramkach danych
* Wczytywanie danych z pliku

___

In [1]:
#import bibliotek
import numpy as np
import pandas as pd

In [2]:
import matplotlib.pyplot as plt
plt.style.use('ggplot')

## Serie danych

### Tworzenie serii danych
Tworzenie serii danych na podstawie listy, macierzy lub słownika

In [3]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

***Tworzenie na podstawie listy***

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
obj = pd.Series(my_list,labels)
obj.values
obj.index

Index(['a', 'b', 'c'], dtype='object')

***Tworzenie na podstawie macierzy***

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

***Tworzenie na podstawie słownika***

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Użycie indeksów

In [11]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])                                   
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,3,4],index = ['USA', 'Germany','Italy', 'Japan'])                                   
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

Odwołanie do serii po indeksie

In [13]:
ser1['USA']

1

Operacje na seriach bazują na indeksach

In [14]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [15]:
ser1[ ser1>2 ]

USSR     3
Japan    4
dtype: int64

In [16]:
ser1*2

USA        2
Germany    4
USSR       6
Japan      8
dtype: int64

In [17]:
np.exp(ser1)

USA         2.718282
Germany     7.389056
USSR       20.085537
Japan      54.598150
dtype: float64

In [18]:
'USA' in ser1

True

In [19]:
ser1.isnull()

USA        False
Germany    False
USSR       False
Japan      False
dtype: bool

In [20]:
ser2.notnull()

USA        True
Germany    True
Italy      True
Japan      True
dtype: bool

## Ramki danych

Utworzenie ramki danych wypełnionej losowymi wartościami.

In [21]:
np.random.seed(101)

In [22]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.head()

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df.tail()

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

### Selekcja i indeksowanie

In [27]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
# Lista nazw kolumn
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [29]:
# Składnia "SQLowa" - NIE REKOMENDOWANA!
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
# Kolumny ramek są seriami
type(df['W'])

pandas.core.series.Series

***Tworzenie nowej kolumny***

In [31]:
df['new'] = df['W'] + df['Y']

In [32]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
df['new2'] = 1

In [34]:
df

          W         X         Y         Z       new  new2
A  2.706850  0.628133  0.907969  0.503826  3.614819     1
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959     1
C -2.018168  0.740122  0.528813 -0.589001 -1.489355     1
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542     1
E  0.190794  1.978757  2.605967  0.683509  2.796762     1

***Usuwanie kolumny***

In [35]:
df.drop('new',axis=1)

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     1
D  0.188695 -0.758872 -0.933237  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

In [36]:
# Usunięcie kolumny nie jest permanentne dopóki tego nie zadeklarujemy jawnie
# Kolumna cały czas jest!
df

          W         X         Y         Z       new  new2
A  2.706850  0.628133  0.907969  0.503826  3.614819     1
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959     1
C -2.018168  0.740122  0.528813 -0.589001 -1.489355     1
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542     1
E  0.190794  1.978757  2.605967  0.683509  2.796762     1

In [37]:
df.drop('new', axis=1, inplace=True)
# df = df.drop('new', axis=1)
# df = df.drop(columns=['new'])

In [38]:
# Dopiero teraz jej nie ma
df

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     1
D  0.188695 -0.758872 -0.933237  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

***Usunięcie wiersza***

In [39]:
df.drop('C')

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
D  0.188695 -0.758872 -0.933237  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

In [40]:
df.drop(['A','C'])

          W         X         Y         Z  new2
B  0.651118 -0.319318 -0.848077  0.605965     1
D  0.188695 -0.758872 -0.933237  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

In [41]:
df.drop('E',axis=0)

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     1
D  0.188695 -0.758872 -0.933237  0.955057     1

***Wybór wiersza***

In [42]:
# Na podstawie etykiety
df.loc['A']

W       2.706850
X       0.628133
Y       0.907969
Z       0.503826
new2    1.000000
Name: A, dtype: float64

In [43]:
# Na podstawie indeksu
df.iloc[2]

W      -2.018168
X       0.740122
Y       0.528813
Z      -0.589001
new2    1.000000
Name: C, dtype: float64

***Wybór podzbioru kolumn i wierszy***

In [44]:
df.loc['B','Y']

-0.8480769834036315

In [45]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

**Selekcja warunkowa**

In [46]:
df

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     1
D  0.188695 -0.758872 -0.933237  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

In [47]:
df>0

       W      X      Y      Z  new2
A   True   True   True   True  True
B   True  False  False   True  True
C  False   True   True  False  True
D   True  False  False   True  True
E   True   True   True   True  True

In [48]:
df[df>0]

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118       NaN       NaN  0.605965     1
C       NaN  0.740122  0.528813       NaN     1
D  0.188695       NaN       NaN  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

In [50]:
df[df['W']>0]

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
D  0.188695 -0.758872 -0.933237  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

In [51]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [52]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [53]:
# Możemy łączyć warunki & (oznacza and) lub | (oznacza or)
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z  new2
E  0.190794  1.978757  2.605967  0.683509     1

**Więcej o indeksach**

In [54]:
df

          W         X         Y         Z  new2
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     1
D  0.188695 -0.758872 -0.933237  0.955057     1
E  0.190794  1.978757  2.605967  0.683509     1

In [55]:
# Reset do indeksu domyślnego 0,1...n
df.reset_index()

  index         W         X         Y         Z  new2
0     A  2.706850  0.628133  0.907969  0.503826     1
1     B  0.651118 -0.319318 -0.848077  0.605965     1
2     C -2.018168  0.740122  0.528813 -0.589001     1
3     D  0.188695 -0.758872 -0.933237  0.955057     1
4     E  0.190794  1.978757  2.605967  0.683509     1

In [56]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z  new2 States
A  2.706850  0.628133  0.907969  0.503826     1     CA
B  0.651118 -0.319318 -0.848077  0.605965     1     NY
C -2.018168  0.740122  0.528813 -0.589001     1     WY
D  0.188695 -0.758872 -0.933237  0.955057     1     OR
E  0.190794  1.978757  2.605967  0.683509     1     CO

In [57]:
df.set_index('States')

               W         X         Y         Z  new2
States
CA      2.706850  0.628133  0.907969  0.503826     1
NY      0.651118 -0.319318 -0.848077  0.605965     1
WY     -2.018168  0.740122  0.528813 -0.589001     1
OR      0.188695 -0.758872 -0.933237  0.955057     1
CO      0.190794  1.978757  2.605967  0.683509     1

In [58]:
df

          W         X         Y         Z  new2 States
A  2.706850  0.628133  0.907969  0.503826     1     CA
B  0.651118 -0.319318 -0.848077  0.605965     1     NY
C -2.018168  0.740122  0.528813 -0.589001     1     WY
D  0.188695 -0.758872 -0.933237  0.955057     1     OR
E  0.190794  1.978757  2.605967  0.683509     1     CO

In [59]:
df.set_index('States',inplace=True)
df

               W         X         Y         Z  new2
States
CA      2.706850  0.628133  0.907969  0.503826     1
NY      0.651118 -0.319318 -0.848077  0.605965     1
WY     -2.018168  0.740122  0.528813 -0.589001     1
OR      0.188695 -0.758872 -0.933237  0.955057     1
CO      0.190794  1.978757  2.605967  0.683509     1

**Indeksy hierarchiczne**

In [60]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [61]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [62]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [63]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [64]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [ ]:
df.index.names

In [ ]:
df.index.names = ['Group','Num']
df

In [ ]:
df.xs('G1')

In [ ]:
df.xs(['G1',1])

In [ ]:
df.xs(1,level='Num')

## Braki danych

In [1]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

NameError: name 'pd' is not defined

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1)

In [ ]:
df.dropna(thresh=2)

In [ ]:
df.fillna(value='BRAK')

In [ ]:
df['A'].fillna(value=df['A'].mean())

## Grupowanie (group by)

In [ ]:
# Tworzymy ramkę danych
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

Teraz możemy użyć metody groupby() żeby pogrupować wiersze

In [ ]:
df.groupby('Company')

In [ ]:
# Przypisujemy grupę do zmiennej
by_comp = df.groupby("Company")

In [ ]:
# Wykonujemy agregację na grupie
by_comp.mean()

In [ ]:
df.groupby('Company').mean()

In [ ]:
# Inne metody agregacji na grupie
by_comp.std()

In [ ]:
by_comp.min()

In [ ]:
by_comp.max()

In [ ]:
by_comp.count()

In [ ]:
by_comp.describe()

In [ ]:
by_comp.describe().transpose()

In [ ]:
by_comp.describe().transpose()['GOOG']

In [ ]:
flights = pd.read_csv('../data/flights.csv')
flights.head()

In [ ]:
flights.groupby('AIRLINE')['ARR_DELAY'].agg('mean').head()

In [ ]:
flights.groupby('AIRLINE').agg({'ARR_DELAY':'mean'}).head()

In [ ]:
flights.groupby('AIRLINE')['ARR_DELAY'].agg(np.mean).head()

In [ ]:
flights.groupby('AIRLINE')['ARR_DELAY'].mean().head()

In [ ]:
# The number of cancelled flights for every airline per day weekday
flights.groupby(['AIRLINE', 'WEEKDAY'])['CANCELLED'].agg('sum').head(7)

In [ ]:
#Find the number and percentage of cancelled and diverted flights for every airline per weekday
flights.groupby(['AIRLINE', 'WEEKDAY'])['CANCELLED', 'DIVERTED'].agg(['sum', 'mean']).head(7)

In [ ]:
# For each origin to destination flight, find the total number of flights, 
# the number and percentage of cancelled flights and the average and variance of the airtime. 
group_cols = ['ORG_AIR', 'DEST_AIR']
agg_dict = {'CANCELLED':['sum', 'mean', 'size'], 
            'AIR_TIME':['mean', 'var']}
flights.groupby(group_cols).agg(agg_dict).head()
# flights.groupby(['ORG_AIR', 'DEST_AIR']).agg({'CANCELLED': ['sum', 'mean', 'size'], 
#                                               'AIR_TIME':['mean', 'var']}).head()

In [ ]:
airline_info = flights.groupby(['AIRLINE', 'WEEKDAY'])\
                      .agg({'DIST':['sum', 'mean'], 
                                    'ARR_DELAY':['min', 'max']}).astype(int)
airline_info.head()

In [ ]:
level0 = airline_info.columns.get_level_values(0)
level0

In [ ]:
level1 = airline_info.columns.get_level_values(1)
level1

In [ ]:
airline_info.columns = level0 + '_' + level1

In [ ]:
airline_info.head(7)

In [ ]:
airline_info.reset_index().head(7)

In [ ]:
flights.groupby(['AIRLINE'], as_index=False)['DIST'].agg('mean').round(0)

In [ ]:
flights.groupby(['AIRLINE'], as_index=False, sort=False)['DIST'].agg('mean')

In [ ]:
college = pd.read_csv('../data/college.csv')
college.head()

In [ ]:
college.groupby('STABBR')['UGDS'].agg(['mean', 'std']).round(0).head()

In [ ]:
def max_deviation(s):
    std_score = (s - s.mean()) / s.std()
    return std_score.abs().max()

In [ ]:
college.groupby('STABBR')['UGDS'].agg(max_deviation).round(1).head()

## Łączenie danych

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3

**Złączanie (concatenate)**

In [ ]:
pd.concat([df1,df2,df3])

In [ ]:
pd.concat([df1,df2,df3],axis=1)

**Łączenie (merge)**

In [2]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

NameError: name 'pd' is not defined

In [ ]:
left

In [ ]:
right

In [ ]:
# Łączenie po kluczu
pd.merge(left,right,how='inner',on='key')

In [ ]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
# Łączenie po dwóch kluczach
pd.merge(left, right, on=['key1', 'key2'])

In [ ]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

In [ ]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

In [ ]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

**Łączenie (join)**

In [ ]:
eft = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
left.join(right)

In [ ]:
left.join(right, how='outer')

## Operacje na ramkach danych

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

***Unikalne wartości***

In [ ]:
# Unikalne wartości
df['col2'].unique()

In [ ]:
# Liczba unikalnych wartości
df['col2'].nunique()

In [ ]:
# Liczba poszczególnych wartości
df['col2'].value_counts()

***Selekcja danych***

In [ ]:
#Selekcja z wykorzystaniem kryteriów bazujących na wielu kolumnach
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [ ]:
newdf

***Zastosowanie funkcji***

In [ ]:
def times2(x):
    return x*2

In [ ]:
newdf['col1'].apply(times2)

In [ ]:
newdf['col1'].map(times2)

In [ ]:
newdf['col3'].apply(len)

In [ ]:
newdf['col1'].sum()

***Usuwanie kolumny na stałe***

In [ ]:
del df['col1']

In [ ]:
df

***Nazwy kolumn i indeksów***

In [ ]:
df.columns

In [ ]:
df.index

***Sortowanie***

In [ ]:
df

In [ ]:
df.sort_values(by='col2') #inplace=False by default

***Sprawdzanie braków***

In [ ]:
df.isnull()

In [ ]:
# Usuwanie wierczy z brakami danych
df.dropna()

***Uzupełnianie braków danych (wartości NaN)***

In [ ]:
import numpy as np

df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

In [ ]:
df.fillna('UZUP')

## Wczytywanie danych z pliku

*** Wczytanie z CSV***

In [ ]:
df = pd.read_csv("..\\data\\example.csv")
df

In [ ]:
import pandas as pd
file = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
df = pd.read_csv(file, header=None, sep=',', decimal='.')

In [ ]:
lista_column = ['sepal_length','sepal_width','petal_length','petal_width']
df = df = pd.read_csv(file, header=None, sep=',', decimal='.', names=lista_column)

In [ ]:
df

***Zapisanie do CSV***

In [ ]:
df.to_csv("example_out.csv",index=False)

***Wczytanie z Excel***

In [ ]:
df = pd.read_excel('../data/Excel_Sample.xlsx', na_values = 'n/a')

In [ ]:
df

In [ ]:
df.info()

In [ ]:
df = pd.read_excel('../data/Excel_Sample.xlsx', na_values = 'n/a', sheet_name='testowy')

In [ ]:
df

In [ ]:
df.info()

In [ ]:
df = pd.read_excel('../data/Excel_Sample.xlsx', na_values = 'n/a', sheet_name=['testowy','testowy2'])
df.info()

In [ ]:
df['testowy'].info()

In [ ]:
xls = pd.ExcelFile('../data/Excel_Sample.xlsx')
slownik = xls.sheet_names
print(slownik)
example = pd.read_excel(xls, sheet_name=slownik[2], na_values='n/a')
example.info()

***Zapisanie do Excel***

In [ ]:
df.to_excel('Excel_Sample_out.xlsx',sheet_name='Sheet1')

***Tworzenie tabeli przestawnej***

In [ ]:
# Pivot table jeszcze raz 
df = pd.read_excel("../data/salesfunnel.xlsx")
df.head()
df["Status"] = df["Status"].astype("category")
df["Status"].cat.set_categories(["won","pending","presented","declined"],inplace=True)

In [ ]:
df.head()

In [ ]:
# Do każdej tabeli pivot mysisz określić ramke danych oraz wskazać index.
pd.pivot_table(df,index=["Name"])

In [ ]:
# Index może zawierać więcej niż jedną kolumnę.
pd.pivot_table(df,index=["Name","Rep","Manager"])

Do wyświetlenia interesujących nas kolumn użyjemy własności values

Pierwszym agregatem będzie suma (np.sum). Ustawiamy ją dla parametry aggfunc.

Możemy korzystać również z listy i podać więcej agregacji.

In [ ]:
pd.pivot_table(df,index=["Manager", "Rep"])

In [ ]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"])

In [ ]:
# sumowanie
tab = pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],aggfunc=np.sum)

In [ ]:
tab.plot(kind='bar');

In [ ]:
# wiecej agregacji
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],aggfunc=[np.mean,len])

Opcja columns jest opcjonalna. Warto pamiętać, że agregacje tyczą się opcji values.

In [ ]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],columns=["Product"],aggfunc=[np.sum])

In [ ]:
tab = pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],columns=["Product"],aggfunc=[np.sum],fill_value=0)

In [ ]:
tab.plot(kind='bar')

In [ ]:
# dodajmy jeszcze quantity
pd.pivot_table(df,index=["Manager","Rep"],values=["Price","Quantity"], columns=["Product"],aggfunc=[np.sum],fill_value=0)

In [ ]:
pd.pivot_table(df,index=["Manager","Status"],columns=["Product"],values=["Quantity","Price"],aggfunc={"Quantity":len,"Price":np.sum},fill_value=0)

In [ ]:
table = pd.pivot_table(df,index=["Manager","Status"],columns=["Product"],values=["Quantity","Price"],aggfunc={"Quantity":len,"Price":[np.sum,np.mean]},fill_value=0)
table

In [ ]:
table.plot(kind='bar')

In [ ]:
movie = pd.read_csv('../data/movie.csv')
movie.head()

In [ ]:
columns = movie.columns
index = movie.index
data = movie.values

In [ ]:
columns

In [ ]:
index

In [ ]:
data

In [ ]:
index.values

In [ ]:
columns.values

In [ ]:
movie.dtypes

In [ ]:
# movie.get_dtype_counts()

movie.dtypes.value_counts()

In [ ]:
director = movie['director_name']
director.to_frame()

In [ ]:
movie.head()

In [ ]:
movie.tail()

In [ ]:
director.describe()

In [ ]:
sample = {'year':[2010,2011,2012,2013,2014,2015],
          'winning team':['KKR','CSK','KKR','Pune warriors','CSK','Delhi daredevils'],
          'wins':[14,13,5,1,4,6],
          'losses':[2,5,1,2,3,5]}

dataf = pd.DataFrame(sample)
numerical = dataf.wins

In [ ]:
print(numerical.min())
print(numerical.max())
print(numerical.std())
print(numerical.mean())
print(numerical.median())
print(numerical.sum())

In [ ]:
numerical.describe()

In [ ]:
numerical.quantile([.1, .2, .3, .4, .5, .6, .7, .8, .9])

In [ ]:
director.value_counts(normalize=True)

In [ ]:
director.isnull()

In [ ]:
director.notnull()

In [ ]:
director_dropped = director.dropna()

In [ ]:
director_dropped.count()

In [ ]:
director_filled = director.fillna(0)

In [ ]:
director_filled.count()

In [ ]:
imdb_score = movie['imdb_score']
imdb_score

In [ ]:
imdb_score + 2

In [ ]:
imdb_score * 2.5

In [ ]:
imdb_score / 7

In [ ]:
imdb_score > 7

In [ ]:
director == 'James Cameron'

In [ ]:
a = imdb_score // 7
a.astype('int')

In [ ]:
movie2 = movie.set_index('movie_title')
movie2

In [ ]:
pd.read_csv('../data/movie.csv', index_col='movie_title')

In [ ]:
movie2.reset_index()

# Renaming row and column names

In [ ]:
movie = pd.read_csv('../data/movie.csv', index_col='movie_title')

In [ ]:
idx_rename = {'Avatar':'Ratava', 'Spectre': 'Ertceps'} 
col_rename = {'director_name':'Director Name', 
              'num_critic_for_reviews': 'Critical Reviews'}

In [ ]:
movie.rename(index=idx_rename, 
             columns=col_rename).head()

In [ ]:
# wersja alternatywna

movie = pd.read_csv('../data/movie.csv', index_col='movie_title')
index = movie.index
columns = movie.columns

index_list = index.tolist()
column_list = columns.tolist()

index_list[0] = 'Ratava'
index_list[2] = 'Ertceps'
column_list[1] = 'Director Name'
column_list[2] = 'Critical Reviews'

In [ ]:
print(index_list[:5])

In [ ]:
print(column_list)

In [ ]:
movie.index = index_list
movie.columns = column_list

In [ ]:
movie.head()

# Selecting columns with methods

In [ ]:
movie = pd.read_csv('../data/movie.csv', index_col='movie_title')
movie.dtypes.value_counts()

In [ ]:
movie.info()

In [ ]:
movie.select_dtypes(include=['int64']).head()

In [ ]:
movie.select_dtypes(include=[np.number]).head()

In [ ]:
bbbb

In [ ]:
movie.filter(regex='\d').head()

In [ ]:
movie.filter(items=['actor_1_name', 'asdf']).head()

In [ ]:
college = pd.read_csv('../data/college.csv')

In [ ]:
college.head()

In [ ]:
college.describe(include=[np.number]).T

In [ ]:
college.describe(include=[np.object, pd.Categorical]).T

In [ ]:
college.describe(include=[np.number], 
                 percentiles=[.01, .05, .10, .25, .5, .75, .9, .95, .99]).T

### naj naj

In [ ]:
movie = pd.read_csv('../data/movie.csv')
movie2 = movie[['movie_title', 'imdb_score', 'budget']]
movie2.head()

In [ ]:
movie2.nlargest(100, 'imdb_score').head()

In [ ]:
movie2.nlargest(100, 'imdb_score').nsmallest(5, 'budget')

>Zadanie. Uzyskaj ten sam efekt przy pomocy sortowania

In [ ]:
college = pd.read_csv('../data/college.csv', index_col='INSTNM')
college.loc['Sp':'Su']

In [ ]:
college = college.sort_index()

In [ ]:
college.head()

In [ ]:
college.loc['Sp':'Su']